loadtesting/tsung/tsung-cached.xml
<!DOCTYPE tsung SYSTEM "/opt/local/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug" version="1.0">
<!-- Client side setup -->
  <clients>
  </clients>
<!-- Server side setup -->
  <servers>
    <server host="localhost" port="80" type="tcp"/>
  </servers>
<!-- to start os monitoring (cpu, network, memory). Use an erlang
  agent on the remote machine or SNMP. erlang is the default -->
  <monitoring>
  </monitoring>
  <load >
<!-- several arrival phases can be set: for each phase, you can set
  the mean inter-arrival time between new clients and the phase
  duration -->
    <arrivalphase phase="1" duration="4" unit="minute">
      <users interarrival="0.005" unit="second"/>
    </arrivalphase>
  </load>
  <options>
    <option type="ts_http" name="user_agent">
      <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
      <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>
<!-- start a session for a http user. the probability is the
  frequency of this type os session. The sum of all session's
  probabilities must be 100 -->
  <sessions>
<session name='basic' probability='100'  type='ts_http'>
<request>
<match do="continue" when="match">
WHATS NEW
</match>
<http url='http://10.0.1.129:8080/loadtest/cached' version='1.1' method='GET'>
</http>
</request>
</session>
  </sessions>
</tsung>